CFD Projects/serpentine_cooling_CFD_project/serpentine_cooling/case_rib/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - thermophysicalProperties
  Fluid: Liquid Water at ~300 K (coolant)
  Properties at 300 K:
    rho   = 998.2  kg/m3
    Cp    = 4182   J/kg.K
    mu    = 1.002e-3 Pa.s (dynamic viscosity)
    nu    = 1.004e-6 m2/s (kinematic viscosity)
    kappa = 0.6003 W/m.K  (thermal conductivity)
    Pr    = 6.99
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   18.015;     // Water molecular weight (g/mol)
    }

    equationOfState
    {
        rho         998.2;      // Density of water at 300 K (kg/m3)
    }

    thermodynamics
    {
        Cp          4182;       // Specific heat capacity (J/kg.K)
        Hf          0;          // Heat of fusion (J/kg) - 0 for liquid
    }

    transport
    {
        mu          1.002e-3;   // Dynamic viscosity (Pa.s)
        Pr          6.99;       // Prandtl number
    }
}
